[{"title":"洋蔥的DNA","date":"2022-07-13T15:23:28.000Z","path":"2022/07/13/洋蔥的DNA/","text":"Photograph by Tony Chen (flickr)P.S.不是我的手","tags":[]},{"title":"程式筆記-二元搜尋法","date":"2022-06-11T05:46:07.000Z","path":"2022/06/11/程式筆記-二元搜尋法/","text":"二元搜尋法需先將資料排序好。二元搜尋法：將鍵值和中間位置資料比較，若鍵值較小則往前半部搜尋；若鍵值較大則往後半部搜尋，直到搜尋到資料或沒有資料可搜尋為止。","tags":[]},{"title":"星際效應電影分析","date":"2022-05-30T02:11:03.000Z","path":"2022/05/30/星際效應心得/","text":"1.電影劇情的脈絡與轉折一開始地球已不適合生存。在某次沙塵暴，墨菲房間沙子意外的有特定排列，推出座標後變前往NASA基地，後來庫柏被布蘭德教授吹捧去太空救人類。__拉撒路行動A計畫：確認那三顆星球是否適合居住，教授則在地球解重力方程B計畫：帶受精卵到適合的地方繁衍。轉折：教授騙了大家，他早就解開重力方程，只是要送人類去太空必須知道黑洞秘密，但是自然法則限制了赤裸奇點，故教授支持B計畫。但地球的人要等死，人性會扔救自己，所以教授選擇用A計畫唬爛。2.黑洞、蟲洞、白洞的差別分別造成甚麼效應?黑洞：一顆年老且巨大的星球在生命即將結束時，會塌陷入自體之中，變成體積微小，密度卻極重的物體。效應：其重力比一百萬個太陽還大，它可吸入任何物體，甚至光線。http://edresource.nmns.edu.tw/ShowObject.aspx?id=0b81a1fa1d0b81d9f55b0b81d91bad蟲洞：是宇宙中可能存在的連接兩個不同時空的狹窄隧道。效應：可以做瞬時間的空間轉移或者做時間旅行，在另一邊得到所謂的「鏡射宇宙」。https://zh.wikipedia.org/wiki/%E8%99%AB%E6%B4%9E白洞：是一個只發射、不吸收的特殊宇宙天體。效應：白洞周圍具有很強的引力場，它把附近的塵埃、氣體和輻射吸引到邊界上來，產生很高的加速度，從而與從白洞內高速向外噴射的物質微粒相碰撞，產生巨大的能量輻射。https://www.easyatm.com.tw/wiki%E7%99%BD%E6%B4%9E3.在電影之中以甚麼樣態呈現上述三者?蟲洞 59分15秒土星旁的蟲洞，二維假設中是一個圓，在三維就變成了球體，穿越後可以到達另一個星系。裡面是高維空間，控制器完全沒用，只能記錄與觀察。還有時間彎曲效應(根據廣義相對論:質量大的物體周圍會產生時空扭曲)Photograph by Tony Chen (flickr)黑洞 2時17分34秒巨人會高速自旋。「巨人」赤道面上有一片極端細薄的吸積盤，受到「巨人」翹曲的空間和時間之重力透鏡影響而呈現這般模樣。巨人是很久沒被餵食的黑洞，原本受到吸積盤電漿束縛的磁場，有可能已流失大半。同時，先前受磁場推動的噴流，也可能已經消失，對人類相對安全。source:書籍&lt;星際效應:電影幕後的科學事實、推測與想像&gt;Photograph by Tony Chen (flickr)4.電影劇情中，他們怎麼穿越&#x2F;進入黑洞?為何要這樣做?穿越蟲洞：為了到達以巨人黑洞為中心的星系，他們開進土星旁的蟲洞，裡面是高維空間，控制器完全沒用，只能記錄與觀察。穿越黑洞：主角的飛船利用黑洞重力彈弓想要增加速度以達到第三顆星球艾德蒙斯。影片中母船在黑洞附近把兩艘小飛船丟進黑洞，就是一個Penrose過程，所以母船可以獲得更大的能量。這個過程在太陽系是不可能實現的。庫伯決定脫離永續號被吸入黑洞，把剩下的資源讓艾米莉亞去艾德蒙斯，庫柏後來掉進超立方體，時間被化為實體。5.對於電影呈現黑洞與蟲洞的方式有甚麼想法與感受?曼恩為了活命，發出假訊號讓太空船來拯救自己、教授為了延攬人類的未來拋棄地球的人都是人性。庫柏為了趕快回去跟女兒見面，考量回程燃料與時間而將任務成敗放在第二位，是一種自私。庫柏在五次元空間中說是未來的人類在幫助自己(推測)，改變重力和放置蟲洞的可能是別的生物，而唯一可以廣泛延伸到所有維度中的力就是重力，所以就算再神通廣大，未來人也只能藉由重力「干涉」過去。另外看完整部片最大的啟發就是愛的力量，庫柏雖然在高維空間，卻可以用手錶跟三維空間的人聯繫，那隻手錶是庫柏在離別前給女兒的信物，頗具意義，代表著愛可以超越時空限制。 備註：若有引用他人文章想法，會附上引注資料與網址。","tags":[]},{"title":"小小閱讀心得","date":"2022-05-29T14:15:47.000Z","path":"2022/05/29/小小閱讀心得/","text":"書名：練習忘記：討厭的事最好立刻忘掉，從現在開始變幸福的90堂課書籍作者：江宓蓁出版單位：八方出版股份有限公司出版年月：2016.11一、圖書作者與內容簡介這本書是一位心理諮商師植西聰的著作，作者生於日本東京都，學習院大學畢業後，曾任職於資生堂。獨立開業後，從事以「心理學」、「東洋思想」、「正面思考」等為基礎的人生理論研究。全書共有9個章節，共90篇。包含了工作挫折、失戀傷心、被人背叛、出糗丟臉等人生會面臨的瑣事，告訴我們練習忘記的重要性以及如何練習忘記。二、內容摘錄必須忘記的不是畏懼失敗，而是畏懼失敗的心情中國古代的思想書《淮南子》有云: 「非不貪生而畏死也，惑於恐死而反忘生也」曾有人因為過度害怕死亡，反而忘記生存所需的重要之事，最後自己召來了死亡。文忠的「死亡」也可以解釋成「失敗」。換言之，這句話想表達的意思就是「因為害怕失敗，反而忘了眼下應該完成的大事。也因此召來了更大的失敗」。p34 三、我的觀點閱讀完這本書後，我感到豁然開朗，因為我已學會如何忘記那些人生中的絆腳石，書中有些事跟我的生活經驗息息相關，例如:第三十篇章「不要試圖追尋已經隨水流去的花朵」，是啊!人生當中充滿諸多遺憾，做任何事前不後悔固然重要，但有些事無法預料也確實發生了，我的學生生涯有著不勝枚舉的考試，考前我焚膏油以繼晷，恆兀兀以窮年，想拿個亮眼的成績，沒想到一時粗心大意，就和既定目標差了一點，那一刻，我只剩下無限的遺憾，不禁懊惱著，我的努力就這麼白費了。隨水流去的花朵代表著這些事已成過去，無須念念不忘，至於怎麼忘記，書中也給了許多辦法，其中個人覺得第89篇章「忙著進行某事的時候，就是獲得了遺忘的機會」很適合我。當我在清閒無事的時候，容易胡思亂想，便難以忘卻這份失落感，短期間可以出門運動或做點家事，長時間可以培養自己的興趣等。","tags":[]},{"title":"誰創立了這個網站??","date":"2022-05-26T07:02:41.000Z","path":"2022/05/26/個人簡介/","text":"個人簡介作者名稱: 陳思齊興趣是: 游泳、溜冰、繪畫等我來自新北市立海山高中網站創立時間：2022&#x2F;5&#x2F;11網站內容：為了賦予網站價值，之後兩年仍繼續經營，題材不拘，可以是創作或生活記事。","tags":[]},{"title":"美術課作品","date":"2022-05-26T07:02:41.000Z","path":"2022/05/26/美術課作品/","text":"這幅畫在畫的是未來科技潛艇，為了讓它與眾不同，變賦予高貴的金，用鮮明的顏色、強烈的對比來凸顯他的氣質。若是用鐵色，應是淡然無味。船身採用水性色鉛筆，背景則是色鉛混水彩，光是構圖便用了好幾堂課，尤其細節部分耗時。看那海平面漂浮著綠色不明物體，究竟何物？姑且當作滿是藻類生存的歡樂景象。 Photograph by Tony Chen (flickr)","tags":[]}]